//
// Created by liii on 2018/1/23.
//

#include <string.h>
#include "crowbar.h"

MessageFormat crb_compile_error_message_format[] = {
        {"dummy"},
        {"($(token) 附近有语法错误)"},
        {"错误的字符串 ($(bar_char))"},
        {"函数名重复 ($(name))"},
        {"dummy"},
};

MessageFormat crb_runtime_error_message_format[] = {
        {"dummy"},
        {"找不到变量名 ($(name))。"},
        {"找不到函数 ($(name))。"},
        {"传递的参数多于函数所要求的参数"},
        {"传递的参数少于函数所要求的参数"},
        {"Ìõ¼þ±í´ïÊ½µÄÖµ±ØÐëÊÇbooleanÐÍ¡£"},
        {"¼õ·¨ÔËËãµÄ²Ù×÷Êý±ØÐëÊÇÊýÖµÀàÐÍ¡£"},
        {"Ë«Ä¿²Ù×÷·û$(operator)µÄ²Ù×÷ÊýÀàÐÍ²»ÕýÈ·¡£"},
        {"$(operator)²Ù×÷·û²»ÄÜÓÃÓÚbooleanÐÍ¡£"},
        {"ÇëÎªfopen()º¯Êý´«ÈëÎÄ¼þµÄÂ·¾¶ºÍ´ò¿ª·½Ê½£¨Á½Õß¶¼ÊÇ×Ö·û´®ÀàÐÍµÄ£©¡£"},
        {"ÇëÎªfclose()º¯Êý´«ÈëÎÄ¼þÖ¸Õë¡£"},
        {"ÇëÎªfgets()º¯Êý´«ÈëÎÄ¼þÖ¸Õë¡£"},
        {"ÇëÎªfputs()º¯Êý´«ÈëÎÄ¼þÖ¸ÕëºÍ×Ö·û´®¡£"},
        {"nullÖ»ÄÜÓÃÓÚÔËËã·û == ºÍ !=(²»ÄÜ½øÐÐ$(operator)²Ù×÷)¡£"},
        {"²»ÄÜ±»0³ý¡£"},
        {"È«¾Ö±äÁ¿$(name)²»´æÔÚ¡£"},
        {"²»ÄÜÔÚº¯ÊýÍâÊ¹ÓÃglobalÓï¾ä¡£"},
        {"ÔËËã·û$(operator)²»ÄÜÓÃÓÚ×Ö·û´®ÀàÐÍ¡£"},
        {"dummy"},
};